# GetPoints Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveByPoints..::..GetPoints Method
CurveByPoints Class See Also
---
Get the sequence of points interpolated by this curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ReferencePointArray GetPoints()
```

Visual Basic
---
```text
Public Function GetPoints As ReferencePointArray
```

Visual C++
---
```text
public:
ReferencePointArray^ GetPoints()
```

# See Also
CurveByPoints Class
Autodesk.Revit.DB Namespace